OpenROAD 24Q3-10021-gc8a6603b7f 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 16 thread(s).
read_liberty /OpenROAD-flow-scripts/flow/platforms/nangate45/lib/NangateOpenCellLibrary_typical.lib
read_db ./results/nangate45/gcd/base/5_2_route.odb
filler_placement "FILLCELL_X1 FILLCELL_X2 FILLCELL_X4 FILLCELL_X8 FILLCELL_X16 FILLCELL_X32"
[INFO DPL-0001] Placed 285 filler instances.
Elapsed time: 0:00.31[h:]min:sec. CPU time: user 0.26 sys 0.05 (100%). Peak memory: 101952KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
5_3_fillcell                       0             99 9793df0f24cf34ea457e
